cherry-embedded/CherryUSB/port/ch32/usb_hc_usbfs.c
#include "usbh_core.h"
#include "usbh_hub.h"
#include "usb_ch32_usbfs_reg.h"

#if defined(CH581) || defined(CH582) || defined(CH583) || defined(CH571) || defined(CH572) || defined(CH573)
#undef USBFS_BASE
#undef USBFS_HOST

#ifndef USBFS_BASE
#pragma message "USB2 is used by default"
#define USBFS_BASE ((uint32_t)0x40008400u)
#endif

#define USBFS_HOST ((USB_FS_TypeDef *)USBFS_BASE)

#undef USBFS_UH_PRE_PID_EN
#undef USBFS_UH_SOF_EN
#define USBFS_UH_PRE_PID_EN 0x80 /*!< USB host PRE PID enable for low speed device via hub */
#define USBFS_UH_SOF_EN     0x40 /*!< USB host automatic SOF enable */

#undef USBFS_UH_R_AUTO_TOG
#undef USBFS_UH_R_TOG
#undef USBFS_UH_R_RES
#define USBFS_UH_R_AUTO_TOG 0x10 /*!< enable automatic toggle after successful transfer completion: 0=manual toggle, 1=automatic toggle */
#define USBFS_UH_R_TOG      0x80 /*!< expected data toggle flag of host receiving (IN): 0=DATA0, 1=DATA1 */
#define USBFS_UH_R_RES      0x04 /*!< prepared handshake response type for host receiving (IN): 0=ACK (ready), 1=no response, time out to device, for isochronous transactions */

#undef USBFS_UH_T_AUTO_TOG
#undef USBFS_UH_T_TOG
#undef USBFS_UH_T_RES
#define USBFS_UH_T_AUTO_TOG 0x10 /*!< enable automatic toggle after successful transfer completion: 0=manual toggle, 1=automatic toggle */
#define USBFS_UH_T_TOG      0x40 /*!< prepared data toggle flag of host transmittal (SETUP/OUT): 0=DATA0, 1=DATA1 */
#define USBFS_UH_T_RES      0x01 /*!< expected handshake response type for host transmittal (SETUP/OUT): 0=ACK (ready), 1=no response, time out from device, for isochronous transactions */

void USBH_IRQHandler(void) __attribute__((section(".highcode")));
#elif defined(CH32F203) || defined(CH32F205) || defined(CH32F207) || defined(CH32F208)
void USBH_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
#elif defined(CH32V203) || defined(CH32V303) || defined(CH32V305) || defined(CH32V307) || defined(CH32V208)
void USBH_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
#else
#error "Do not support"
#endif

#ifndef USBH_IRQHandler
#pragma message "Please make sure your platform interrupt name"
#define USBH_IRQHandler USB2_IRQHandler
#endif

#ifndef CONFIG_USBHOST_PIPE_NUM
#define CONFIG_USBHOST_PIPE_NUM 8
#endif

typedef enum {
    USB_EP0_STATE_SETUP = 0x0, /**< SETUP DATA */
    USB_EP0_STATE_IN_DATA,     /**< IN DATA */
    USB_EP0_STATE_IN_STATUS,   /**< IN status */
    USB_EP0_STATE_OUT_DATA,    /**< OUT DATA */
    USB_EP0_STATE_OUT_STATUS,  /**< OUT status */
} ep0_state_t;

struct chusb_pipe {
    uint8_t dev_addr;
    uint8_t ep_addr;
    uint8_t ep_type;
    uint8_t ep_interval;
    uint8_t speed;
    uint16_t ep_mps;
    bool inuse;
    uint32_t xfrd;
    volatile bool waiter;

    uint32_t xferlen;
    uint8_t *buffer;
    uint8_t data_pid;

    usb_osal_sem_t waitsem;
    struct usbh_hubport *hport;
    struct usbh_urb *urb;
};

struct chusb_hcd {
    volatile bool port_csc;
    volatile bool port_pec;
    volatile bool port_pe;
    volatile uint8_t current_token;
    volatile uint8_t ep0_state;
    volatile uint8_t has_reseted;
    volatile bool prv_get_zero;
    volatile bool prv_set_zero;
    volatile bool main_pipe_using;
    uint32_t current_pipe_timeout;
    struct chusb_pipe *current_pipe;
    struct chusb_pipe pipe_pool[CONFIG_USBHOST_PIPE_NUM][2]; /* Support Bidirectional ep */
} g_chusb_hcd;

static inline void SET_UH_RX_CTRL_BIT(uint8_t bit)
{
    if ((USBFS_HOST->HOST_RX_CTRL & USBFS_UH_R_AUTO_TOG) != 0) {
        /**
         * USBFS_UH_R_TOG canot write
         */
        if ((bit & USBFS_UH_R_TOG) != 0) {
            /**
             * bit contains USBFS_UH_R_TOG
             */
            USBFS_HOST->HOST_RX_CTRL &= ~(USBFS_UH_R_AUTO_TOG);
            USBFS_HOST->HOST_RX_CTRL |= (USBFS_UH_R_AUTO_TOG | bit);
        } else {
            USBFS_HOST->HOST_RX_CTRL |= bit;
        }
    } else {
        USBFS_HOST->HOST_RX_CTRL |= bit;
    }
}

static inline void SET_UH_TX_CTRL_BIT(uint8_t bit)
{
    if ((USBFS_HOST->HOST_TX_CTRL & USBFS_UH_T_AUTO_TOG) != 0) {
        /**
         * USBFS_UH_T_TOG canot write
         */
        if ((bit & USBFS_UH_T_TOG) != 0) {
            /**
             * bit contains USBFS_UH_T_TOG
             */
            USBFS_HOST->HOST_TX_CTRL &= ~(USBFS_UH_T_AUTO_TOG);
            USBFS_HOST->HOST_TX_CTRL |= (USBFS_UH_T_AUTO_TOG | bit);
        } else {
            USBFS_HOST->HOST_TX_CTRL |= bit;
        }
    } else {
        USBFS_HOST->HOST_TX_CTRL |= bit;
    }
}

static inline void CLEAR_UH_TX_CTRL_BIT(uint8_t bit)
{
    if ((USBFS_HOST->HOST_TX_CTRL & USBFS_UH_T_AUTO_TOG) != 0) {
        /**
         * USBFS_UH_T_TOG canot write
         */
        if ((bit & USBFS_UH_T_TOG) != 0) {
            /**
             * bit contains USBFS_UH_T_TOG
             */
            USBFS_HOST->HOST_TX_CTRL &= ~(USBFS_UH_T_AUTO_TOG);
            USBFS_HOST->HOST_TX_CTRL &= ~(bit);
            USBFS_HOST->HOST_TX_CTRL |= USBFS_UH_T_AUTO_TOG;
        } else {
            USBFS_HOST->HOST_TX_CTRL &= ~(bit);
        }
    } else {
        USBFS_HOST->HOST_TX_CTRL &= ~(bit);
    }
}

static inline void CLEAR_UH_RX_CTRL_BIT(uint8_t bit)
{
    if ((USBFS_HOST->HOST_RX_CTRL & USBFS_UH_R_AUTO_TOG) != 0) {
        /**
         * USBFS_UH_R_TOG can't write
         */
        if ((bit & USBFS_UH_R_TOG) != 0) {
            /**
             * bit contains USBFS_UH_R_TOG
             */
            USBFS_HOST->HOST_RX_CTRL &= ~(USBFS_UH_R_AUTO_TOG);
            USBFS_HOST->HOST_RX_CTRL &= ~(bit);
            USBFS_HOST->HOST_RX_CTRL |= USBFS_UH_R_AUTO_TOG;
        } else {
            USBFS_HOST->HOST_RX_CTRL &= ~(bit);
        }
    } else {
        USBFS_HOST->HOST_RX_CTRL &= ~(bit);
    }
}

static inline void SET_UH_RX_CTRL(uint8_t value)
{
    USBFS_HOST->HOST_RX_CTRL = 0;
    USBFS_HOST->HOST_RX_CTRL = value;
    USB_LOG_DBG("USBFS_HOST->HOST_RX_CTRL:%02x\r\n", USBFS_HOST->HOST_RX_CTRL);
}

static inline void SET_UH_TX_CTRL(uint8_t value)
{
    USBFS_HOST->HOST_TX_CTRL = 0;
    USBFS_HOST->HOST_TX_CTRL = value;
    USB_LOG_DBG("USBFS_HOST->HOST_TX_CTRL:%02x\r\n", USBFS_HOST->HOST_TX_CTRL);
}

