cherry-embedded/CherryUSB/port/ch32/usb_hc_usbfs.c
static inline void INT_PRE_HANDLER(void)
{
#if defined(CH581) || defined(CH582) || defined(CH583) || defined(CH571) || defined(CH572) || defined(CH573)
#else
    asm("csrrw sp,mscratch,sp");
    extern void rt_interrupt_enter(void);
    rt_interrupt_enter();
#endif
}

static inline void INT_POST_HANDLER(void)
{
#if defined(CH581) || defined(CH582) || defined(CH583) || defined(CH571) || defined(CH572) || defined(CH573)
#else
    extern void rt_interrupt_leave(void);
    rt_interrupt_leave();
    asm("csrrw sp,mscratch,sp");
#endif
}

static int8_t chusb_host_pipe_transfer(struct chusb_pipe *pipe, uint8_t pid, uint8_t *data, uint32_t len)
{
    /*!< Updata current transfer pid */
    g_chusb_hcd.current_token = pid;
    /*!< Updata curretn pipe */
    g_chusb_hcd.current_pipe = pipe;
    /*!< Updata curretn pipe timeout */
    g_chusb_hcd.current_pipe_timeout = pipe->urb->timeout;
    /*!< Updata main pipe using flag */
    g_chusb_hcd.main_pipe_using = true;

    if (data == NULL && len > 0) {
        return -1;
    }

    if (pid == USB_PID_SETUP) {
        /*!< Record the data len */
        g_chusb_hcd.current_pipe->xferlen = len;

        if ((uint32_t)data & 0x03) {
            USB_LOG_INFO("SETUP DMA address is not align \r\n");
            return -3;
        }

        USBFS_HOST->HOST_TX_DMA = (uint16_t)(uint32_t)data;

        /*!< Record the data buffer address */
        pipe->buffer = data;

        if (len > pipe->ep_mps) {
            len = pipe->ep_mps;
        }

        USBFS_HOST->HOST_TX_LEN = len;
        USBFS_HOST->HOST_EP_PID = pid << 4 | (pipe->ep_addr & 0x0f);

    } else if (pid == USB_PID_OUT) {
        /*!< Record the data len */
        g_chusb_hcd.current_pipe->xferlen = len;

        if (len == 0) {
            USBFS_HOST->HOST_TX_LEN = len;
            USBFS_HOST->HOST_EP_PID = pid << 4 | (pipe->ep_addr & 0x0f);
            return 0;
        }

        if ((uint32_t)data & 0x03) {
            USB_LOG_INFO("OUT DMA address is not align \r\n");
            return -3;
        }

        USBFS_HOST->HOST_TX_DMA = (uint16_t)(uint32_t)data;

        /*!< Record the data buffer address */
        pipe->buffer = data;

        if (len > pipe->ep_mps) {
            len = pipe->ep_mps;
        }

        USBFS_HOST->HOST_TX_LEN = len;
        USBFS_HOST->HOST_EP_PID = pid << 4 | (pipe->ep_addr & 0x0f);

    } else if (pid == USB_PID_IN) {
        /*!< Record the data len */
        g_chusb_hcd.current_pipe->xferlen = len;

        if (len == 0) {
            /*!< Want get 0 length data */
        } else {
            if ((uint32_t)data & 0x03) {
                USB_LOG_INFO("IN DMA address is not align \r\n");
                return -3;
            }
            USBFS_HOST->HOST_RX_DMA = (uint16_t)(uint32_t)data;
            pipe->buffer = data;
        }

        USBFS_HOST->HOST_EP_PID = pid << 4 | (pipe->ep_addr & 0x0f);
    }

    return 0;
}

static void chusb_control_pipe_init(struct chusb_pipe *pipe, struct usb_setup_packet *setup, uint8_t *buffer, uint32_t buflen)
{
    if (g_chusb_hcd.ep0_state == USB_EP0_STATE_SETUP) {
        /**
         * Setup is distributed as DATA0
         */
        SET_UH_TX_CTRL(USBFS_UH_T_AUTO_TOG);
        pipe->data_pid = 0;
        chusb_host_pipe_transfer(pipe, USB_PID_SETUP, (uint8_t *)setup, 8);
    } else if (g_chusb_hcd.ep0_state == USB_EP0_STATE_IN_DATA) {
        if (pipe->data_pid != 1) {
            USB_LOG_ERR("IN_DATA PID Error\r\n");
        }
        SET_UH_RX_CTRL(USBFS_UH_R_AUTO_TOG | USBFS_UH_R_TOG);
        chusb_host_pipe_transfer(pipe, USB_PID_IN, buffer, buflen);
    } else if (g_chusb_hcd.ep0_state == USB_EP0_STATE_OUT_DATA) {
        if (pipe->data_pid != 1) {
            USB_LOG_ERR("OUT_DATA PID Error\r\n");
        }
        chusb_host_pipe_transfer(pipe, USB_PID_OUT, buffer, buflen);
    } else if (g_chusb_hcd.ep0_state == USB_EP0_STATE_IN_STATUS) {
        /**
         * Status stage must be DATA1
         */
        // SET_UH_RX_CTRL_BIT(USBFS_UH_R_TOG);
        pipe->data_pid = 1;
        SET_UH_RX_CTRL(USBFS_UH_R_AUTO_TOG | USBFS_UH_R_TOG);
        chusb_host_pipe_transfer(pipe, USB_PID_IN, NULL, 0);
    } else if (g_chusb_hcd.ep0_state == USB_EP0_STATE_OUT_STATUS) {
        /**
         * Status stage must be DATA1
         */
        // SET_UH_TX_CTRL_BIT(USBFS_UH_T_TOG);
        pipe->data_pid = 1;
        SET_UH_TX_CTRL(USBFS_UH_T_AUTO_TOG | USBFS_UH_T_TOG);
        chusb_host_pipe_transfer(pipe, USB_PID_OUT, NULL, 0);
    }
}

static void chusb_bulk_pipe_init(struct chusb_pipe *pipe, uint8_t *buffer, uint32_t buflen)
{
    if (pipe->ep_addr & 0x80) {
        /*!< IN */
        g_chusb_hcd.current_token = USB_PID_IN;
        if (pipe->data_pid == 1) {
            SET_UH_RX_CTRL(USBFS_UH_R_AUTO_TOG | USBFS_UH_R_TOG);
        } else {
            SET_UH_RX_CTRL(USBFS_UH_R_AUTO_TOG);
        }
    } else {
        /*!< OUT */
        g_chusb_hcd.current_token = USB_PID_OUT;
        if (pipe->data_pid == 1) {
            SET_UH_TX_CTRL(USBFS_UH_T_AUTO_TOG | USBFS_UH_T_TOG);
        } else {
            SET_UH_TX_CTRL(USBFS_UH_T_AUTO_TOG);
        }
    }

    chusb_host_pipe_transfer(pipe, g_chusb_hcd.current_token, buffer, buflen);
}

static void chusb_intr_pipe_init(struct chusb_pipe *pipe, uint8_t *buffer, uint32_t buflen)
{
    if (pipe->ep_addr & 0x80) {
        /*!< IN */
        g_chusb_hcd.current_token = USB_PID_IN;
        if (pipe->data_pid == 1) {
            SET_UH_RX_CTRL(USBFS_UH_R_AUTO_TOG | USBFS_UH_R_TOG);
        } else {
            SET_UH_RX_CTRL(USBFS_UH_R_AUTO_TOG);
        }
    } else {
        /*!< OUT */
        g_chusb_hcd.current_token = USB_PID_OUT;
        if (pipe->data_pid == 1) {
            SET_UH_TX_CTRL(USBFS_UH_T_AUTO_TOG | USBFS_UH_T_TOG);
        } else {
            SET_UH_TX_CTRL(USBFS_UH_T_AUTO_TOG);
        }
    }

    chusb_host_pipe_transfer(pipe, g_chusb_hcd.current_token, buffer, buflen);
}

static void chusb_iso_pipe_init(struct chusb_pipe *pipe, uint8_t *buffer, uint32_t buflen)
{
    if (pipe->ep_type != USB_ENDPOINT_TYPE_ISOCHRONOUS) {
        USB_LOG_ERR("Endpoint type is not ISOCHRONOUS\r\n");
        return;
    }

    if (pipe->ep_addr & 0x80) {
        /*!< IN */
        g_chusb_hcd.current_token = USB_PID_IN;
        SET_UH_RX_CTRL(USBFS_UH_R_AUTO_TOG | USBFS_UH_R_RES);
    } else {
        /*!< OUT */
        g_chusb_hcd.current_token = USB_PID_OUT;
        SET_UH_TX_CTRL(USBFS_UH_T_AUTO_TOG | USBFS_UH_T_RES);
    }

    chusb_host_pipe_transfer(pipe, g_chusb_hcd.current_token, buffer, buflen);
}

static void chusbh_set_self_speed(uint8_t speed)
{
    if (speed == USB_SPEED_HIGH) {
    } else if (speed == USB_SPEED_FULL) {
        USBFS_HOST->BASE_CTRL &= ~USBFS_UC_LOW_SPEED;
        USBFS_HOST->HOST_CTRL &= ~USBFS_UH_LOW_SPEED;
        USBFS_HOST->HOST_SETUP &= ~USBFS_UH_PRE_PID_EN;
    } else {
        USBFS_HOST->BASE_CTRL |= USBFS_UC_LOW_SPEED;
        USBFS_HOST->HOST_CTRL |= USBFS_UH_LOW_SPEED;
        USBFS_HOST->HOST_SETUP |= USBFS_UH_PRE_PID_EN;
    }
}

