cherry-embedded/CherryUSB/port/ch32/usb_hc_usbfs.c
static int usbh_reset_port(const uint8_t port)
{
    g_chusb_hcd.has_reseted = 0x01;
    g_chusb_hcd.port_pe = 0;
    /*!< Set dev add 0 */
    USBFS_HOST->DEV_ADDR = (USBFS_HOST->DEV_ADDR & USBFS_UDA_GP_BIT) | (0x00 & USBFS_USB_ADDR_MASK);
    /*!< Close port */
    USBFS_HOST->HOST_CTRL &= ~USBFS_UH_PORT_EN;
    /*!< Start reset */
    USBFS_HOST->HOST_CTRL |= USBFS_UH_BUS_RESET;
    usb_osal_msleep(30);
    /*!< Stop reset */
    USBFS_HOST->HOST_CTRL &= ~USBFS_UH_BUS_RESET;
    usb_osal_msleep(20);
    /*!< Enable HUB Port */
    USBFS_HOST->HOST_CTRL |= USBFS_UH_PORT_EN;
    USBFS_HOST->HOST_SETUP |= USBFS_UH_SOF_EN;
    g_chusb_hcd.port_pe = 1;
    return 0;
}

static uint8_t usbh_get_port_speed(const uint8_t port)
{
    (void)port;
    uint8_t speed = 0;

    if (USBFS_HOST->MIS_ST & USBFS_UMS_DEV_ATTACH) {
        speed = (USBFS_HOST->MIS_ST & USBFS_UMS_DM_LEVEL) ? 0 : 1;
        if (speed == 0) {
            /*!< Low speed */
            USBFS_HOST->HOST_CTRL |= USBFS_UH_LOW_SPEED;
            speed = USB_SPEED_LOW;
        } else {
            /*!< Full speed */
            USBFS_HOST->HOST_CTRL &= ~USBFS_UH_LOW_SPEED;
            speed = USB_SPEED_FULL;
        }
    }

    return speed;
}

__WEAK void usb_hc_low_level_init(void)
{
}

int usb_hc_init(void)
{
    memset(&g_chusb_hcd, 0, sizeof(struct chusb_hcd));

    for (uint8_t i = 0; i < CONFIG_USBHOST_PIPE_NUM; i++) {
        g_chusb_hcd.pipe_pool[i][0].waitsem = usb_osal_sem_create(0);
        g_chusb_hcd.pipe_pool[i][1].waitsem = usb_osal_sem_create(0);
    }

    usb_hc_low_level_init();
    USBFS_HOST->BASE_CTRL = USBFS_UC_RESET_SIE | USBFS_UC_CLR_ALL;
    static uint32_t wait_ct = 50000;
    while (wait_ct--) {
    }
    USBFS_HOST->BASE_CTRL = 0;

    USBFS_HOST->BASE_CTRL = USBFS_UC_HOST_MODE;
    USBFS_HOST->HOST_CTRL = 0;

    USBFS_HOST->DEV_ADDR = 0x00;

    USBFS_HOST->HOST_EP_MOD = USBFS_UH_EP_TX_EN | USBFS_UH_EP_RX_EN;

    USBFS_HOST->HOST_RX_CTRL = 0;
    USBFS_HOST->HOST_TX_CTRL = 0;

    USBFS_HOST->BASE_CTRL = USBFS_UC_HOST_MODE | USBFS_UC_INT_BUSY | USBFS_UC_DMA_EN;
    // USBFS_HOST->HOST_SETUP = USBFS_UH_SOF_EN;
    USBFS_HOST->INT_FG = 0xFF;

    USBFS_HOST->INT_EN = USBFS_UIE_TRANSFER | USBFS_UIE_DETECT;
    return 0;
}

int usbh_roothub_control(struct usb_setup_packet *setup, uint8_t *buf)
{
    uint8_t nports;
    uint8_t port;
    uint32_t status;

    nports = CONFIG_USBHOST_MAX_RHPORTS;
    port = setup->wIndex;
    if (setup->bmRequestType & USB_REQUEST_RECIPIENT_DEVICE) {
        switch (setup->bRequest) {
            case HUB_REQUEST_CLEAR_FEATURE:
                switch (setup->wValue) {
                    case HUB_FEATURE_HUB_C_LOCALPOWER:
                        break;
                    case HUB_FEATURE_HUB_C_OVERCURRENT:
                        break;
                    default:
                        return -EPIPE;
                }
                break;
            case HUB_REQUEST_SET_FEATURE:
                switch (setup->wValue) {
                    case HUB_FEATURE_HUB_C_LOCALPOWER:
                        break;
                    case HUB_FEATURE_HUB_C_OVERCURRENT:
                        break;
                    default:
                        return -EPIPE;
                }
                break;
            case HUB_REQUEST_GET_DESCRIPTOR:
                break;
            case HUB_REQUEST_GET_STATUS:
                memset(buf, 0, 4);
                break;
            default:
                break;
        }
    } else if (setup->bmRequestType & USB_REQUEST_RECIPIENT_OTHER) {
        switch (setup->bRequest) {
            case HUB_REQUEST_CLEAR_FEATURE:
                if (!port || port > nports) {
                    return -EPIPE;
                }

                switch (setup->wValue) {
                    case HUB_PORT_FEATURE_ENABLE:
                        break;
                    case HUB_PORT_FEATURE_SUSPEND:
                    case HUB_PORT_FEATURE_C_SUSPEND:
                        break;
                    case HUB_PORT_FEATURE_POWER:
                        break;
                    case HUB_PORT_FEATURE_C_CONNECTION:
                        g_chusb_hcd.port_csc = 0;
                        break;
                    case HUB_PORT_FEATURE_C_ENABLE:
                        g_chusb_hcd.port_pec = 0;
                        break;
                    case HUB_PORT_FEATURE_C_OVER_CURREN:
                        break;
                    case HUB_PORT_FEATURE_C_RESET:
                        break;
                    default:
                        return -EPIPE;
                }
                break;
            case HUB_REQUEST_SET_FEATURE:
                if (!port || port > nports) {
                    return -EPIPE;
                }

                switch (setup->wValue) {
                    case HUB_PORT_FEATURE_SUSPEND:
                        break;
                    case HUB_PORT_FEATURE_POWER:
                        break;
                    case HUB_PORT_FEATURE_RESET:
                        usbh_reset_port(port);
                        break;

                    default:
                        return -EPIPE;
                }
                break;
            case HUB_REQUEST_GET_STATUS:
                if (!port || port > nports) {
                    return -EPIPE;
                }

                status = 0;
                if (g_chusb_hcd.port_csc) {
                    status |= (1 << HUB_PORT_FEATURE_C_CONNECTION);
                }
                if (g_chusb_hcd.port_pec) {
                    status |= (1 << HUB_PORT_FEATURE_C_ENABLE);
                }

                if (g_chusb_hcd.port_pe) {
                    status |= (1 << HUB_PORT_FEATURE_CONNECTION);
                    status |= (1 << HUB_PORT_FEATURE_ENABLE);
                    if (usbh_get_port_speed(port) == USB_SPEED_LOW) {
                        status |= (1 << HUB_PORT_FEATURE_LOWSPEED);
                    } else if (usbh_get_port_speed(port) == USB_SPEED_HIGH) {
                        status |= (1 << HUB_PORT_FEATURE_HIGHSPEED);
                    }
                }

                memcpy(buf, &status, 4);
                break;
            default:
                break;
        }
    }
    return 0;
}

int usbh_ep0_pipe_reconfigure(usbh_pipe_t pipe, uint8_t dev_addr, uint8_t ep_mps, uint8_t speed)
{
    struct chusb_pipe *ppipe = (struct chusb_pipe *)pipe;

    ppipe->dev_addr = dev_addr;
    ppipe->ep_mps = ep_mps;
    ppipe->speed = speed;

