cherry-embedded/CherryUSB/port/ch32/usb_hc_usbfs.c
    if (speed == USB_SPEED_HIGH) {
        USB_LOG_INFO("ep0 reconfigure USB_SPEED_HIGH \r\n");
    } else if (speed == USB_SPEED_FULL) {
        USB_LOG_INFO("ep0 reconfigure USB_SPEED_FULL \r\n");
        chusbh_set_self_speed(USB_SPEED_FULL);
    } else if (speed == USB_SPEED_LOW) {
        USB_LOG_INFO("ep0 reconfigure USB_SPEED_LOW \r\n");
        chusbh_set_self_speed(USB_SPEED_LOW);
    }

    USBFS_HOST->DEV_ADDR = (USBFS_DEV_ADDR_OFFSET & USBFS_UDA_GP_BIT) | (dev_addr & USBFS_USB_ADDR_MASK);
    return 0;
}

int usbh_pipe_alloc(usbh_pipe_t *pipe, const struct usbh_endpoint_cfg *ep_cfg)
{
    struct chusb_pipe *ppipe;
    uint8_t ep_idx;
    usb_osal_sem_t waitsem;

    ep_idx = ep_cfg->ep_addr & 0x7f;

    if (ep_idx > CONFIG_USBHOST_PIPE_NUM) {
        return -ENOMEM;
    }

    if (ep_cfg->ep_addr & 0x80) {
        ppipe = &g_chusb_hcd.pipe_pool[ep_idx][1];
    } else {
        ppipe = &g_chusb_hcd.pipe_pool[ep_idx][0];
    }

    /* store variables */
    waitsem = ppipe->waitsem;

    memset(ppipe, 0, sizeof(struct chusb_pipe));

    ppipe->ep_addr = ep_cfg->ep_addr;
    ppipe->ep_type = ep_cfg->ep_type;
    ppipe->ep_mps = ep_cfg->ep_mps;
    ppipe->ep_interval = ep_cfg->ep_interval;
    ppipe->speed = ep_cfg->hport->speed;
    ppipe->dev_addr = ep_cfg->hport->dev_addr;
    ppipe->hport = ep_cfg->hport;

    if (ep_cfg->ep_type == USB_ENDPOINT_TYPE_CONTROL) {
    } else {
        if (ppipe->speed == USB_SPEED_HIGH) {
        } else if (ppipe->speed == USB_SPEED_FULL) {
        } else if (ppipe->speed == USB_SPEED_LOW) {
        }
    }
    /* restore variable */
    ppipe->inuse = true;
    ppipe->waitsem = waitsem;

    *pipe = (usbh_pipe_t)ppipe;
    return 0;
}

int usbh_pipe_free(usbh_pipe_t pipe)
{
    return 0;
}

int usbh_submit_urb(struct usbh_urb *urb)
{
    struct chusb_pipe *pipe;
    size_t flags;
    int ret = 0;

    if (!urb) {
        USB_LOG_INFO("urb is null \r\n");
        return -EINVAL;
    }

    pipe = urb->pipe;

    if (!pipe) {
        USB_LOG_INFO("pipe is null \r\n");
        return -EINVAL;
    }

    if (!pipe->hport->connected) {
        USB_LOG_INFO("!pipe->hport->connected \r\n");
        return -ENODEV;
    }

    if (pipe->urb) {
        USB_LOG_INFO("pipe->urb is not null\r\n");
        return -EBUSY;
    }

    if (g_chusb_hcd.main_pipe_using == true) {
        USB_LOG_INFO("usbh_submit_urb//main pipe is using\r\n");
        return -EBUSY;
    }

    flags = usb_osal_enter_critical_section();

    pipe->waiter = false;
    pipe->xfrd = 0;
    pipe->urb = urb;
    urb->errorcode = -EBUSY;
    urb->actual_length = 0;

    if (urb->timeout > 0) {
        pipe->waiter = true;
    }
    usb_osal_leave_critical_section(flags);

    switch (pipe->ep_type) {
        case USB_ENDPOINT_TYPE_CONTROL:
            g_chusb_hcd.ep0_state = USB_EP0_STATE_SETUP;
            chusb_control_pipe_init(pipe, urb->setup, urb->transfer_buffer, urb->transfer_buffer_length);
            break;
        case USB_ENDPOINT_TYPE_BULK:
            chusb_bulk_pipe_init(pipe, urb->transfer_buffer, urb->transfer_buffer_length);
            break;
        case USB_ENDPOINT_TYPE_INTERRUPT:
            chusb_intr_pipe_init(pipe, urb->transfer_buffer, urb->transfer_buffer_length);
            break;
        case USB_ENDPOINT_TYPE_ISOCHRONOUS:
            chusb_iso_pipe_init(pipe, urb->transfer_buffer, urb->transfer_buffer_length);
            break;
        default:
            break;
    }
    if (urb->timeout > 0) {
        /* wait until timeout or sem give */
        ret = usb_osal_sem_take(pipe->waitsem, urb->timeout);
        if (ret < 0) {
            goto errout_timeout;
        }

        g_chusb_hcd.current_pipe_timeout = 0;

        ret = urb->errorcode;
    }
    return ret;
errout_timeout:
    pipe->waiter = false;
    usbh_kill_urb(urb);
    return ret;
}

int usbh_kill_urb(struct usbh_urb *urb)
{
    return 0;
}

static inline void chusb_pipe_waitup(struct chusb_pipe *pipe, bool callback)
{
    struct usbh_urb *urb;

    urb = pipe->urb;
    pipe->urb = NULL;
    g_chusb_hcd.main_pipe_using = false;

    if (pipe->waiter) {
        pipe->waiter = false;
        usb_osal_sem_give(pipe->waitsem);
    }

    if (callback == true) {
        if (urb->complete) {
            if (urb->errorcode < 0) {
                urb->complete(urb->arg, urb->errorcode);
            } else {
                urb->complete(urb->arg, urb->actual_length);
            }
        }
    }
}

static int8_t chusb_outpipe_irq_handler(uint8_t res_state)
{
    uint16_t current_tx_length = USBFS_HOST->HOST_TX_LEN;
    struct usbh_urb *urb;
    urb = (g_chusb_hcd.current_pipe->urb);

    if (g_chusb_hcd.current_pipe->ep_type != USB_ENDPOINT_TYPE_CONTROL) {
        if ((g_chusb_hcd.current_pipe->ep_addr & 0x80) != 0) {
            /* Error */
            USB_LOG_ERR("ep_addr is not out add \r\n");
            USBFS_HOST->INT_FG = USBFS_UIF_TRANSFER;
            return -1;
        }
    }

    switch (res_state) {
        case USB_PID_STALL:
            urb->errorcode = -EPERM;
            if (g_chusb_hcd.current_token == USB_PID_SETUP) {
                USB_LOG_ERR("USB_PID_SETUP STALL \r\n");
            } else {
                USB_LOG_ERR("USB_PID_OUT STALL \r\n");
                if (g_chusb_hcd.current_pipe->ep_type != USB_ENDPOINT_TYPE_CONTROL) {
                    /**
                     * Reset data pid
                     */
                    g_chusb_hcd.current_pipe->data_pid = 0;
                }
            }
            USBFS_HOST->INT_FG = USBFS_UIF_TRANSFER;
            return -2;
        case USB_PID_NAK:
            urb->errorcode = -EAGAIN;
            if (g_chusb_hcd.current_pipe->ep_type == USB_ENDPOINT_TYPE_CONTROL) {
                if (g_chusb_hcd.current_token == USB_PID_SETUP) {
                    /**
                     * Device must ack for setup package
                     */
                    USB_LOG_ERR("Setup NAK \r\n");
                    g_chusb_hcd.current_token = 0;
                    USBFS_HOST->INT_FG = USBFS_UIF_TRANSFER;
                    return -3;
                } else {
                    if (g_chusb_hcd.current_pipe_timeout > 0) {
                        USB_LOG_DBG("Control endpoint out nak and retry\r\n");
                        chusb_host_pipe_transfer(g_chusb_hcd.current_pipe, USB_PID_OUT,
                                                 g_chusb_hcd.current_pipe->buffer, g_chusb_hcd.current_pipe->xferlen);
                    }
                }
            } else {
                if (g_chusb_hcd.prv_set_zero == true) {
                    /**
                     * It is unlikely to run here, 
                     * because the device can probably receive 0 length byte packets
                     */
                    urb->errorcode = 0;
                    g_chusb_hcd.prv_set_zero = false;
                    g_chusb_hcd.current_token = 0;
                    urb->actual_length = g_chusb_hcd.current_pipe->xfrd;
                    chusb_pipe_waitup(g_chusb_hcd.current_pipe, true);
                } else {
                    if (g_chusb_hcd.current_pipe_timeout > 0) {
                        USB_LOG_DBG("Normal endpoint out nak and retry\r\n");
                        urb->errorcode = -EAGAIN;
                        chusb_host_pipe_transfer(g_chusb_hcd.current_pipe, USB_PID_OUT,
                                                 g_chusb_hcd.current_pipe->buffer, g_chusb_hcd.current_pipe->xferlen);
                    } else {
                        g_chusb_hcd.current_token = 0;
                        if (g_chusb_hcd.current_pipe->xfrd > 0) {
                            /**
                             * The device received data but did not receive it completely
                             */
                            urb->errorcode = -EBUSY;
                            USB_LOG_WRN("The data is not sent completely, but the timeout is 0\r\n");
                            urb->actual_length = g_chusb_hcd.current_pipe->xfrd;
                            chusb_pipe_waitup(g_chusb_hcd.current_pipe, true);
                        } else {
                            /**
                             * The device may not be ready, make sure your device can receive data
                             */
                            USB_LOG_WRN("Your device seems unable to receive data\r\n");
                            urb->errorcode = -EBUSY;
                            chusb_pipe_waitup(g_chusb_hcd.current_pipe, false);
                        }
                    }
                }
            }
            break;
        case USB_PID_ACK:
            /**
             * The last out or setup package was sent
             */
            urb->errorcode = 0;

            if (g_chusb_hcd.current_pipe->ep_type == USB_ENDPOINT_TYPE_CONTROL) {
                /*!< Ctrol endpoint */
                if (g_chusb_hcd.current_token == USB_PID_SETUP) {
                    /*!< Setup package send successfully */
                    urb->actual_length += 8;
                    g_chusb_hcd.current_pipe->data_pid ^= 1;
                    if (g_chusb_hcd.ep0_state == USB_EP0_STATE_SETUP) {
                        if (urb->setup->wLength) {
                            if (urb->setup->bmRequestType & 0x80) {
                                g_chusb_hcd.ep0_state = USB_EP0_STATE_IN_DATA;
                            } else {
                                g_chusb_hcd.ep0_state = USB_EP0_STATE_OUT_DATA;
                            }
                        } else {
                            g_chusb_hcd.ep0_state = USB_EP0_STATE_IN_STATUS;
                        }
                        chusb_control_pipe_init(g_chusb_hcd.current_pipe, urb->setup,
                                                urb->transfer_buffer, urb->transfer_buffer_length);
                    }
                } else if (g_chusb_hcd.current_token == USB_PID_OUT) {
                    if (g_chusb_hcd.ep0_state == USB_EP0_STATE_OUT_DATA) {
                        USB_LOG_DBG("ep0 tx_len:%d\r\n", current_tx_length);
                        g_chusb_hcd.current_pipe->data_pid ^= 1;
                        g_chusb_hcd.current_pipe->xfrd += current_tx_length;
                        g_chusb_hcd.current_pipe->buffer += current_tx_length;
                        g_chusb_hcd.current_pipe->xferlen -= current_tx_length;
                        if (g_chusb_hcd.current_pipe->xferlen == 0) {
                            if (current_tx_length == g_chusb_hcd.current_pipe->ep_mps) {
                                /**
                                 * Need send 0 length data
                                 */
                                chusb_host_pipe_transfer(g_chusb_hcd.current_pipe, USB_PID_OUT, NULL, 0);
                            } else {
                                /*!< Out package send successfully */
                                g_chusb_hcd.ep0_state = USB_EP0_STATE_IN_STATUS;
                                chusb_control_pipe_init(g_chusb_hcd.current_pipe, urb->setup,
                                                        urb->transfer_buffer, urb->transfer_buffer_length);
                            }
                        } else {
                            /*!< Start send next out package */
                            chusb_host_pipe_transfer(g_chusb_hcd.current_pipe, USB_PID_OUT,
                                                     g_chusb_hcd.current_pipe->buffer, g_chusb_hcd.current_pipe->xferlen);
                        }
                    } else if (g_chusb_hcd.ep0_state == USB_EP0_STATE_OUT_STATUS) {
                        g_chusb_hcd.ep0_state = USB_EP0_STATE_SETUP;
                        urb->actual_length += g_chusb_hcd.current_pipe->xfrd;
                        USB_LOG_DBG("S-> I-> O-status stage: In:%d\r\n", urb->actual_length - 8);
                        if (g_chusb_hcd.current_pipe->data_pid != 1) {
                            USB_LOG_ERR("S-> I-> O-status stage DATA PID Error\r\n");
                        } else {
                            g_chusb_hcd.current_pipe->data_pid ^= 1;
                        }
                        chusb_pipe_waitup(g_chusb_hcd.current_pipe, true);
                    }
                }
            } else {
                if (g_chusb_hcd.current_token == USB_PID_OUT) {
                    USB_LOG_DBG("ep%d tx_len:%d\r\n", (g_chusb_hcd.current_pipe->ep_addr & 0x0f), current_tx_length);
                    g_chusb_hcd.current_pipe->data_pid ^= 1;
                    g_chusb_hcd.current_pipe->xfrd += current_tx_length;
                    g_chusb_hcd.current_pipe->buffer += current_tx_length;
                    g_chusb_hcd.current_pipe->xferlen -= current_tx_length;
                    if (g_chusb_hcd.current_pipe->xferlen == 0) {
                        if (current_tx_length == g_chusb_hcd.current_pipe->ep_mps) {
                            /**
                             * Need send 0 length data
                             */
                            if (g_chusb_hcd.prv_set_zero == true) {
                                USB_LOG_ERR("g_chusb_hcd.prv_set_zero is always true\r\n");
                            }
                            g_chusb_hcd.prv_set_zero = true;
                            chusb_host_pipe_transfer(g_chusb_hcd.current_pipe, USB_PID_OUT, NULL, 0);
                        } else {
                            /*!< Out package send successfully */
                            g_chusb_hcd.current_token = 0;
                            if (g_chusb_hcd.prv_set_zero == true) {
                                g_chusb_hcd.prv_set_zero = false;
                            }
                            urb->actual_length = g_chusb_hcd.current_pipe->xfrd;
                            chusb_pipe_waitup(g_chusb_hcd.current_pipe, true);
                        }
                    } else {
                        /*!< Start send next out package */
                        chusb_host_pipe_transfer(g_chusb_hcd.current_pipe, USB_PID_OUT,
                                                 g_chusb_hcd.current_pipe->buffer, g_chusb_hcd.current_pipe->xferlen);
                    }
                } else {
                    USB_LOG_ERR("Error token is not match \r\n");
                    USBFS_HOST->INT_FG = USBFS_UIF_TRANSFER;
                    return -4;
                }
            }
            break;
        case 0:
            if (g_chusb_hcd.current_pipe->ep_type != USB_ENDPOINT_TYPE_ISOCHRONOUS) {
                if (g_chusb_hcd.current_token == USB_PID_SETUP) {
                    USB_LOG_ERR("SETUP TIMEOUT \r\n");
                } else {
                    USB_LOG_ERR("OUT TIMEOUT \r\n");
                    if (g_chusb_hcd.current_pipe->ep_type != USB_ENDPOINT_TYPE_CONTROL) {
                        /**
                         * Reset data pid
                         */
                        g_chusb_hcd.current_pipe->data_pid = 0;
                    }
                }
                urb->errorcode = -EIO;
                USBFS_HOST->INT_FG = USBFS_UIF_TRANSFER;
                return -5;
            } else {
                /**
                 * No response from isochronous endpoint out
                 */
                urb->errorcode = 0;
                chusb_pipe_waitup(g_chusb_hcd.current_pipe, true);
            }
        default:
            break;
    }

    USBFS_HOST->INT_FG = USBFS_UIF_TRANSFER;
    return 0;
}

static int8_t chusb_inpipe_irq_handler(uint8_t res_state)
{
    uint16_t rx_len = 0;
    struct usbh_urb *urb;
    urb = (g_chusb_hcd.current_pipe->urb);

    if (g_chusb_hcd.current_pipe->ep_type != USB_ENDPOINT_TYPE_CONTROL) {
        if ((g_chusb_hcd.current_pipe->ep_addr & 0x80) == 0) {
            /* Error */
            USB_LOG_ERR("ep_addr is not in add\r\n");
            USBFS_HOST->INT_FG = USBFS_UIF_TRANSFER;
            return -1;
        }
    }

