cherry-embedded/CherryUSB/port/ch32/usb_hc_usbfs.c
    switch (res_state) {
        case USB_PID_STALL:
            USB_LOG_ERR("USB_PID_IN USB_PID_STALL\r\n");
            g_chusb_hcd.current_token = 0;
            urb->errorcode = -EPERM;
            USBFS_HOST->INT_FG = USBFS_UIF_TRANSFER;
            return -2;
        case USB_PID_NAK:
            g_chusb_hcd.current_token = 0;
            if (g_chusb_hcd.current_pipe->ep_type == USB_ENDPOINT_TYPE_CONTROL) {
                if (g_chusb_hcd.current_pipe_timeout > 0) {
                    urb->errorcode = -EAGAIN;
                    chusb_host_pipe_transfer(g_chusb_hcd.current_pipe, USB_PID_IN,
                                             g_chusb_hcd.current_pipe->buffer, g_chusb_hcd.current_pipe->xferlen);
                } else {
                    urb->errorcode = 0;
                }
            } else {
                urb->errorcode = 0;
                if (g_chusb_hcd.prv_get_zero == true) {
                    g_chusb_hcd.prv_get_zero = false;
                    g_chusb_hcd.current_token = 0;
                    urb->actual_length = g_chusb_hcd.current_pipe->xfrd;
                    USB_LOG_DBG("Normal endpoint get zero length package\r\n");
                    chusb_pipe_waitup(g_chusb_hcd.current_pipe, true);
                } else {
                    USB_LOG_DBG("Normal endpoint in nak\r\n");
                    if (g_chusb_hcd.current_pipe->xferlen > 0) {
                        /**
                         * The data has not been transmitted completely
                         */
                        if (g_chusb_hcd.current_pipe->xfrd > 0) {
                            /**
                             * Data was transmitted last time, but this time NAK
                             */
                            if (g_chusb_hcd.current_pipe_timeout > 0) {
                                /**
                                 * Retry in
                                 */
                                chusb_host_pipe_transfer(g_chusb_hcd.current_pipe, USB_PID_IN,
                                                         g_chusb_hcd.current_pipe->buffer, g_chusb_hcd.current_pipe->xferlen);
                            } else {
                                /**
                                 * Some data has been transferred
                                 */
                                USB_LOG_WRN("The device has not finished sending all data, but the timeout is 0\r\n");
                                g_chusb_hcd.current_token = 0;
                                /**
                                 * Update the actual send length
                                 */
                                urb->actual_length = g_chusb_hcd.current_pipe->xfrd;
                                urb->errorcode = -EBUSY;
                                chusb_pipe_waitup(g_chusb_hcd.current_pipe, true);
                            }
                        } else {
                            /**
                             * The device did not send any data. We do not need to call a callback
                             */
                            urb->errorcode = -EBUSY;
                            g_chusb_hcd.current_token = 0;
                            urb->actual_length = 0;
                            chusb_pipe_waitup(g_chusb_hcd.current_pipe, false);
                        }
                    } else {
                        urb->errorcode = -EIO;
                        USB_LOG_ERR("xferlen == 0//should get zero package\r\n");
                        USBFS_HOST->INT_FG = USBFS_UIF_TRANSFER;
                        return -1;
                    }
                }
            }
            break;
        case USB_PID_ACK:
            urb->errorcode = 0;
            break;
        case USB_PID_DATA0:
        case USB_PID_DATA1:
            if ((USBFS_HOST->INT_ST) & USBFS_UIS_TOG_OK) {
                /*!< Data is OK */
                rx_len = USBFS_HOST->RX_LEN;

                urb->errorcode = 0;

                g_chusb_hcd.current_pipe->xfrd += rx_len;

                if (g_chusb_hcd.current_pipe->xferlen < rx_len) {
                    g_chusb_hcd.current_pipe->data_pid ^= 1;
                    USB_LOG_ERR("Please provide the correct data length parameter\r\n");
                    USBFS_HOST->INT_FG = USBFS_UIF_TRANSFER;
                    return -6;
                }

                g_chusb_hcd.current_pipe->xferlen -= rx_len;

                if (g_chusb_hcd.current_pipe->ep_type == USB_ENDPOINT_TYPE_CONTROL) {
                    /*!< Ctrol endpoint */
                    /**
                     * Status stage
                     * 
                     * Setup ---> out data ---> in status stage
                     */
                    if ((g_chusb_hcd.ep0_state == USB_EP0_STATE_IN_STATUS) && (rx_len == 0)) {
                        g_chusb_hcd.ep0_state = USB_EP0_STATE_SETUP;
                        urb->actual_length += rx_len;
                        USB_LOG_DBG("S-> O-> In-status stage: Out:%d\r\n", urb->actual_length - 8);

                        if (g_chusb_hcd.current_pipe->data_pid != 1) {
                            USB_LOG_ERR("S-> O-> In-status stage DATA PID Error//PID:%d\r\n", g_chusb_hcd.current_pipe->data_pid);
                        } else {
                            g_chusb_hcd.current_pipe->data_pid ^= 1;
                        }

                        chusb_pipe_waitup(g_chusb_hcd.current_pipe, true);
                        USBFS_HOST->INT_FG = USBFS_UIF_TRANSFER;
                        return 0;
                    }

                    /**
                     * Setup ---> in data ---> need generate next out status stage
                     */
                    if (g_chusb_hcd.ep0_state == USB_EP0_STATE_IN_DATA) {
                        USB_LOG_DBG("ep0 rx_len:%d\r\n", rx_len);
                        g_chusb_hcd.current_pipe->data_pid ^= 1;
                        if ((g_chusb_hcd.current_pipe->xfrd) > (urb->setup->wLength)) {
                            /**
                             * Error
                             */
                            USB_LOG_ERR("xfrd > setup->wLength\r\n");
                            USBFS_HOST->INT_FG = USBFS_UIF_TRANSFER;
                            return -3;
                        }

