cherry-embedded/CherryUSB/port/ch32/usb_hc_usbfs.c
                        if (rx_len == 0 || (rx_len & (g_chusb_hcd.current_pipe->ep_mps - 1))) {
                            /**
                             * Receive a short package, in data has transfer completed
                             */
                            g_chusb_hcd.current_token = 0;
                            g_chusb_hcd.ep0_state = USB_EP0_STATE_OUT_STATUS;
                            /**
                             * generate next out status stage
                             */
                            chusb_control_pipe_init(g_chusb_hcd.current_pipe, urb->setup,
                                                    urb->transfer_buffer, urb->transfer_buffer_length);
                        } else {
                            /**
                             * Retry in
                             */
                            g_chusb_hcd.current_pipe->buffer += rx_len;
                            chusb_host_pipe_transfer(g_chusb_hcd.current_pipe, USB_PID_IN,
                                                     g_chusb_hcd.current_pipe->buffer, g_chusb_hcd.current_pipe->xferlen);
                        }
                    }
                } else {
                    USB_LOG_DBG("ep%d rx_len:%d\r\n", (g_chusb_hcd.current_pipe->ep_addr & 0x0f), rx_len);
                    g_chusb_hcd.current_pipe->data_pid ^= 1;
                    if (rx_len == 0 || (rx_len & (g_chusb_hcd.current_pipe->ep_mps - 1))) {
                        /**
                         * Receive a short package, in data has transfer completed
                         */
                        g_chusb_hcd.current_token = 0;
                        urb->actual_length = g_chusb_hcd.current_pipe->xfrd;

                        if (g_chusb_hcd.prv_get_zero == true) {
                            g_chusb_hcd.prv_get_zero = false;
                        }

                        chusb_pipe_waitup(g_chusb_hcd.current_pipe, true);
                    } else {
                        /**
                         * Initiate In again
                         */
                        g_chusb_hcd.current_pipe->buffer += rx_len;

                        if (g_chusb_hcd.current_pipe->xferlen == 0) {
                            if (g_chusb_hcd.prv_get_zero == true) {
                                USB_LOG_ERR("g_chusb_hcd.prv_get_zero is always true\r\n");
                                g_chusb_hcd.prv_get_zero = false;
                            }
                            g_chusb_hcd.prv_get_zero = true;
                        }

                        chusb_host_pipe_transfer(g_chusb_hcd.current_pipe, USB_PID_IN,
                                                 g_chusb_hcd.current_pipe->buffer, g_chusb_hcd.current_pipe->xferlen);
                    }
                }
            } else {
                /*!< Discard data out of synchronization */
                USB_LOG_ERR("EP%dData out of sync %d\r\n",
                            (g_chusb_hcd.current_pipe->ep_addr & 0x0f), g_chusb_hcd.current_pipe->data_pid);
                urb->errorcode = -EIO;
                USBFS_HOST->INT_FG = USBFS_UIF_TRANSFER;
                return -3;
            }
            break;
        default:
            break;
    }

    USBFS_HOST->INT_FG = USBFS_UIF_TRANSFER;
    return 0;
}

void USBH_IRQHandler(void)
{
    INT_PRE_HANDLER();
    volatile uint8_t intflag = 0;
    volatile uint8_t res = 0;
    intflag = USBFS_HOST->INT_FG;

    if (intflag & USBFS_UIF_TRANSFER) {
        /*!< Check the equipment response status */
        res = (USBFS_HOST->INT_ST) & USBFS_UIS_ENDP_MASK;
        /*!< Stop this transmission after successful transmission */
        USBFS_HOST->HOST_EP_PID = 0x00;
        switch (g_chusb_hcd.current_token) {
            case USB_PID_SETUP:
            case USB_PID_OUT:
                if (chusb_outpipe_irq_handler(res) < 0) {
                    goto pipe_wait;
                }
                break;
            case USB_PID_IN:
                if (chusb_inpipe_irq_handler(res) < 0) {
                    goto pipe_wait;
                }
                break;
        }
    } else if (intflag & USBFS_UIF_DETECT) {
        if (USBFS_HOST->MIS_ST & USBFS_UMS_DEV_ATTACH) {
            if (g_chusb_hcd.has_reseted == 0x02) {
                g_chusb_hcd.has_reseted = 0;
                USB_LOG_INFO("USB bus reset and dev reconnect \r\n");
            } else {
                USB_LOG_INFO("Dev connect \r\n");
                g_chusb_hcd.port_csc = 1;
                g_chusb_hcd.port_pec = 1;
                g_chusb_hcd.port_pe = 1;
                usbh_roothub_thread_wakeup(1);
            }
        } else {
            if (g_chusb_hcd.has_reseted == 0x01) {
                g_chusb_hcd.has_reseted = 0x02;
                if (g_chusb_hcd.main_pipe_using) {
                    g_chusb_hcd.main_pipe_using = false;
                }
            } else {
                USB_LOG_INFO("Dev remove \r\n");
                /**
                 * Device remove
                 * Disable port and stop send sof
                 */
                USBFS_HOST->HOST_SETUP &= ~USBFS_UH_SOF_EN;
                USBFS_HOST->HOST_CTRL &= ~USBFS_UH_PORT_EN;
                if (g_chusb_hcd.main_pipe_using) {
                    g_chusb_hcd.main_pipe_using = false;
                }
                g_chusb_hcd.port_csc = 1;
                g_chusb_hcd.port_pec = 1;
                g_chusb_hcd.port_pe = 0;
                for (uint8_t index = 0; index < CONFIG_USBHOST_PIPE_NUM; index++) {
                    for (uint8_t j = 0; j < 2; j++) {
                        struct chusb_pipe *pipe = &g_chusb_hcd.pipe_pool[index][j];
                        struct usbh_urb *urb = pipe->urb;
                        if (pipe->waiter) {
                            pipe->waiter = false;
                            urb->errorcode = -ESHUTDOWN;
                            usb_osal_sem_give(pipe->waitsem);
                        }
                    }
                }
                usbh_roothub_thread_wakeup(1);
            }
        }
        USBFS_HOST->INT_FG = USBFS_UIF_DETECT;
    } else {
        USB_LOG_INFO("Unkonwn \r\n");
        USBFS_HOST->INT_FG = intflag;
    }
    INT_POST_HANDLER();
    return;
pipe_wait:
    /**
     * enerally, only errors can arrive here. 
     * After testing, most cases arrive here because of the problem of the DATA PID, 
     * but the transmission will be completed correctly next time.
     */
    chusb_pipe_waitup(g_chusb_hcd.current_pipe, true);
    INT_POST_HANDLER();
}
